performance/results/raw/application/vm/health.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /health
Document Length:        20 bytes

Concurrency Level:      100
Time taken for tests:   4.521 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1640000 bytes
HTML transferred:       200000 bytes
Requests per second:    2212.07 [#/sec] (mean)
Time per request:       45.206 [ms] (mean)
Time per request:       0.452 [ms] (mean, across all concurrent requests)
Transfer rate:          354.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       4
Processing:     8   45   8.4     42     118
Waiting:        3   40   8.0     38     110
Total:         10   45   8.5     42     119

Percentage of the requests served within a certain time (ms)
  50%     42
  66%     45
  75%     47
  80%     49
  90%     54
  95%     61
  98%     70
  99%     80
 100%    119 (longest request)